pkda5203/TM4C123GXL_DMX512_controller/khadka.c
/*
 * Name  : Prabesh Khadka
 * UTA ID: 1001201007
 *
 *
 * CSE4342 Embedded Systems II
 * Spring 2019 Project
 *
 *
 * Hardware initialization code adopted from example code provided by Dr. Losh
 */

//-----------------------------------------------------------------------------
// Hardware Target
//-----------------------------------------------------------------------------

// Target Platform: EK-TM4C123GXL Evaluation Board
// Target uC:       TM4C123GH6PM
// System Clock:    40 MHzz

// Hardware configuration:
// Red LED connected to PF1
// Green LED connected to PF3
// UART Interface:
//  U0TX (PA1) and U0RX (PA0) are connected to the 2nd controller
//  Configured to 115,200 baud, 8N1

//-----------------------------------------------------------------------------
// Device includes, defines, and assembler directives
//-----------------------------------------------------------------------------

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "tm4c123gh6pm.h"


#define RED_LED      (*((volatile uint32_t *)(0x42000000 + (0x400253FC-0x40000000)*32 + 1*4)))
#define GREEN_LED    (*((volatile uint32_t *)(0x42000000 + (0x400253FC-0x40000000)*32 + 3*4)))
#define PIN_U1RX     (*((volatile uint32_t *)(0x42000000 + (0x400063FC-0x40000000)*32 + 4*4)))
#define PIN_U1TX     (*((volatile uint32_t *)(0x42000000 + (0x400063FC-0x40000000)*32 + 5*4)))
#define PIN_DEN      (*((volatile uint32_t *)(0x42000000 + (0x400063FC-0x40000000)*32 + 6*4)))

#define GREEN_LED_MASK 8
#define RED_LED_MASK 2
#define MAX_CHAR 80        //define max character allowed for the commands
#define delay4Cycles() __asm(" NOP\n NOP\n NOP\n NOP")


//https://stackoverflow.com/questions/9146395/reset-c-int-array-to-zero-the-fastest-way
#define ZERO_ANY(T, a, n) do{\
T *a_ = (a);\
size_t n_ = (n);\
for (; n_ > 0; --n_, ++a_)\
*a_ = (T) { 0 };\
} while (0)

#define ARRAY_SIZE(a) (sizeof (a) / sizeof *(a))
#define ZERO_ANY_A(T, a) ZERO_ANY(T, (a), ARRAY_SIZE(a))

//-----------------------------------------------------------------------------
//Global Variables
//-----------------------------------------------------------------------------
uint16_t maxM = 512;
uint8_t dmxData[512];
uint16_t tempData;
uint16_t rxData[512];
uint8_t fieldCount;
uint8_t pos[MAX_CHAR+1];
uint16_t deviceAddress =1; //have to write to eeprom 1 by default
uint8_t ON =0;      //DMX stream initialized to off //have to write to EEPROM
uint8_t MODE= 1;              //define a global variable for controller mode (0: Controller and 1: Device) //have to write to eeprom
uint16_t phase;
uint16_t rxPhase;
uint16_t glob=0;
//-----------------------------------------------------------------------------
// Subroutines
//-----------------------------------------------------------------------------

//code adopted from Dr. losh's provided example
// Initialize Hardware
void initHw()
{
    // Configure HW to work with 16 MHz XTAL, PLL enabled, system clock of 40 MHz
    SYSCTL_RCC_R = SYSCTL_RCC_XTAL_16MHZ | SYSCTL_RCC_OSCSRC_MAIN | SYSCTL_RCC_USESYSDIV | (4 << SYSCTL_RCC_SYSDIV_S);
    
    // Set GPIO ports to use APB (not needed since default configuration -- for clarity)
    // Note UART on port A must use APB
    SYSCTL_GPIOHBCTL_R = 0;
    
    // Enable GPIO port A and F peripherals
    SYSCTL_RCGC2_R = SYSCTL_RCGC2_GPIOA | SYSCTL_RCGC2_GPIOF | SYSCTL_RCGC2_GPIOC;
    
    // Configure LED pins
    GPIO_PORTF_DIR_R = GREEN_LED_MASK | RED_LED_MASK;  // bits 1 and 3 are outputs
    GPIO_PORTF_DR2R_R = GREEN_LED_MASK | RED_LED_MASK; // set drive strength to 2mA (not needed since default configuration -- for clarity)
    GPIO_PORTF_DEN_R = GREEN_LED_MASK | RED_LED_MASK;  // enable LEDs
    
    // Configure UART0 pins
    GPIO_PORTA_DIR_R |= 2;                           // enable output on UART0 TX pin: default, added for clarity
    GPIO_PORTA_DEN_R |= 3;                           // enable digital on UART0 pins: default, added for clarity
    GPIO_PORTA_AFSEL_R |= 3;                         // use peripheral to drive PA0, PA1: default, added for clarity
    GPIO_PORTA_PCTL_R &= 0xFFFFFF00;                 // set fields for PA0 and PA1 to zero
    GPIO_PORTA_PCTL_R |= GPIO_PCTL_PA1_U0TX | GPIO_PCTL_PA0_U0RX;
    // select UART0 to drive pins PA0 and PA1: default, added for clarity
    
    // Configure UART0 to 115200 baud, 8N1 format
    SYSCTL_RCGCUART_R |= SYSCTL_RCGCUART_R0;         // turn-on UART0, leave other UARTs in same status
    delay4Cycles();                                  // wait 4 clock cycles
    UART0_CTL_R = 0;                                 // turn-off UART0 to allow safe programming
    UART0_CC_R = UART_CC_CS_SYSCLK;                  // use system clock (40 MHz)
    UART0_IBRD_R = 21;                               // r = 40 MHz / (Nx115.2kHz), set floor(r)=21, where N=16
    UART0_FBRD_R = 45;                               // round(fract(r)*64)=45
    UART0_LCRH_R = UART_LCRH_WLEN_8 | UART_LCRH_FEN; // configure for 8N1 w/ 16-level FIFO
    UART0_CTL_R = UART_CTL_TXE | UART_CTL_RXE | UART_CTL_UARTEN;
    // enable TX, RX, and module
    
    //configure UART1 pins
    //set tx pin into normal gpio mode and drive zero
    GPIO_PORTC_DIR_R |= 0x60;                        //set the bit 5 and 6 as output and rest as input
    GPIO_PORTC_DEN_R |= 0x70;                        //set digital enable on bits 5 and 6 //drives zero by default
    SYSCTL_RCGCUART_R |= SYSCTL_RCGCUART_R1;         // turn-on UART1, leave other UARTs in same status
    GPIO_PORTC_PCTL_R |= GPIO_PCTL_PC5_U1TX | GPIO_PCTL_PC4_U1RX;
    SYSCTL_RCGCTIMER_R |= SYSCTL_RCGCTIMER_R1;       // turn-on timer
    
}

//intialize hardware for the UART1 RX/ DMX512 receive data
void initUart1RX()
{
    rxPhase=0;
    PIN_DEN=0;
    GPIO_PORTC_AFSEL_R |= 0x10;                       //turn on UART on the pin
    // Configure UART1 to 250000 baud, 8N2 format (must be 3 clocks from clock enable and config writes)
    UART1_CTL_R = 0;                                  // turn-off UART0 to allow safe programming
    // delay4Cycles();
    UART1_CC_R = UART_CC_CS_SYSCLK;                  // use system clock (40 MHz)
    UART1_IBRD_R = 10;                               // r = 40 MHz / (Nx250kHz), set floor(r)=21, where N=16
    UART1_FBRD_R = 0;                               // round(fract(r)*64)=45
    UART1_LCRH_R = UART_LCRH_WLEN_8 | UART_LCRH_FEN |UART_LCRH_STP2 ; // configure for 8N1 w/o FIFO
    UART1_CTL_R = UART_CTL_RXE | UART_CTL_UARTEN;//| UART_CTL_EOT; // enable TX, RX, and module and end of transmission
    UART1_IM_R = UART_IM_RXIM;
    NVIC_EN0_R |= 1 << (INT_UART1-16);               // turn-on interrupt 22 (UART0)
    
    
    //UART1_IM_R = UART_RIS_TXRIS;                     //enable the UART1 interrupt
    
    
