pkda5203/TM4C123GXL_DMX512_controller/khadka.c
}

void initEEPROM()
{
    SYSCTL_RCGCEEPROM_R |=SYSCTL_RCGCEEPROM_R0;
    // EEPROM_EEDBGME_R|=(0xE37B<<16)|EEPROM_EEDBGME_ME;
    delay4Cycles(); //add 6 delay cycle plus the function overhead
    delay4Cycles();
    while(EEPROM_EEDONE_R & EEPROM_EEDONE_WORKING);  //poll the EEDONE register, continue when working=0;
    if ((EEPROM_EESUPP_R & EEPROM_EESUPP_PRETRY)||(EEPROM_EESUPP_R & EEPROM_EESUPP_ERETRY))
    {
        initEEPROM();       //error if the PRETRY and ERETRY bits are set
    }
    //    else
    //    {
    //        //do nothing
    //    }
    SYSCTL_SREEPROM_R|=SYSCTL_SREEPROM_R0;      //EEROM software reset
    SYSCTL_SREEPROM_R&=0;
    
    delay4Cycles();
    delay4Cycles();
    
    while(EEPROM_EEDONE_R & EEPROM_EEDONE_WORKING);  //poll the EEDONE register, continue when working=0;
    //  //  if (EEPROM_EESUPP_R==EEPROM_EESUPP_PRETRY||EEPROM_EESUPP_R==EEPROM_EESUPP_ERETRY)
    //    {
    //        initEEPROM();       //error if the PRETRY and ERETRY bits are set
    //    }
    //    else
    //    {
    //        continue;
    //    }
}

void initTimer1()
{
    PIN_DEN=1;                                       //set PC6 (Data enable pin to high)
    UART1_CTL_R = 0;                                //turn off UART1
    GPIO_PORTC_AFSEL_R = 0;                         //clear the AFSEL register on port c for normal GPIO mode
    GPIO_PORTC_DATA_R &=0xDF;                        //drive zero on the Tx pin
    //Configure Timer 1 for the timer1 interrupt
    //send break
    TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                // turn-off timer before reconfiguring
    TIMER1_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER1_TAMR_R = TIMER_TAMR_TAMR_PERIOD;          // configure for periodic mode (count down)
    TIMER1_TAILR_R = 0x1B80;                           // set load value to 1B80 for interrupt every 176 us
    
    TIMER1_IMR_R = TIMER_IMR_TATOIM;                 // turn-on interrupts
    NVIC_EN0_R |= 1 << (INT_TIMER1A-16);             // turn-on interrupt 37 (TIMER1A)
    TIMER1_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    phase = 0;
    
}

//code adopted from Dr. losh's provided example
// Blocking function that writes a serial character when the UART buffer is not full
void putcUart0(char c)
{
    while (UART0_FR_R & UART_FR_TXFF);               // wait if uart0 tx fifo full
    UART0_DR_R = c;                                  // write character to fifo
}

//code adopted from Dr. losh's provided example
// Blocking function that writes a string when the UART buffer is not full
void putsUart0(char* str)
{
    uint8_t i;
    for (i = 0; i < strlen(str); i++)
    putcUart0(str[i]);
}

//code adopted from Dr. losh's provided example
// Blocking function that returns with serial data once the buffer is not empty
char getcUart0()
{
    while (UART0_FR_R & UART_FR_RXFE);               // wait if uart0 rx fifo empty
    return UART0_DR_R & 0xFF;                        // get character from fifo
}

//code adopted from Dr. losh's provided example
void waitMicrosecond(uint32_t us)
{
    __asm("WMS_LOOP0:   MOV  R1, #6");          // 1
    __asm("WMS_LOOP1:   SUB  R1, #1");          // 6
    __asm("             CBZ  R1, WMS_DONE1");   // 5+1*3
    __asm("             NOP");                  // 5
    __asm("             NOP");                  // 5
    __asm("             B    WMS_LOOP1");       // 5*2 (speculative, so P=1)
    __asm("WMS_DONE1:   SUB  R0, #1");          // 1
    __asm("             CBZ  R0, WMS_DONE0");   // 1
    __asm("             NOP");                  // 1
    __asm("             B    WMS_LOOP0");       // 1*2 (speculative, so P=1)
    __asm("WMS_DONE0:");                        // ---
    // 40 clocks/us + error
}


//Step1: Flash LED to show that the code is up and running proper
void flashRedLed(uint16_t x)
{
    RED_LED=1;      //turn ON red led
    waitMicrosecond(x);
    RED_LED=0;
}

//Step 1: Flash LED to show that the code is up and running
void flashGreenLed(uint16_t x)
{
    GREEN_LED=1;      //turn ON green led
    waitMicrosecond(x);
    GREEN_LED=0;
}

//step 2: get the string from the UART0
void getsUart0(char *str)
{
    int counter=0;
    char uartChar;
    uint16_t len = MAX_CHAR;
    uartChar = getcUart0();
    while(uartChar!= 13 && counter < len)   //is it c/r or the MAX_CHAR?
    {
        if(uartChar == 8)         //is it backspace?
        {
            if(counter)         //if counter is not zero
            {
                str--;
                counter--;
            }
        }
        else if(uartChar >= 32)     //is the char printable??
        {
            *str = tolower(uartChar);   //save the char to string as upper case
            str++;
            counter++;
        }
        uartChar = getcUart0();
    }
    *str = 0;       //add the null terminator
}


//the parse routine that goes through the string and
uint8_t parseCommand(char str1[], uint8_t pos[], char type[])
{
    uint8_t i;
    uint8_t d=1;
    uint8_t fCount;
    uint8_t j;
    uint8_t length =strlen(str1);
    for (i=0; i<length; i++)
    {
        if (str1[i]>96 && str1[i]<123)      //if the character of the string is a alpha a-z
        {
            if(d==1)
            {
                pos[j]=i;
                type[j]='a';
                fCount++;
                j++;
                d=0;
                // putsUart0("d->a\n");
            }
            else
            {
                d=0;
            }
            
        }
        else if (str1[i]>47 && str1[i]<58)     //if the character of the string is a number 0-9
        {
            if(d==1)
            {
                pos[j]=i;      //add the current index to the pos[]
                type[j]='n';
                fCount++;
                j++;
                d=0;
                // putsUart0("d->n\n");
            }
            else
            {
                d=0;
            }
        }
        else    //if the character of the string is a delimiter
        {
            
            d=1;
            str1[i]=0;  //replace all delimiters with null
        }
    }
    type[j]=0;   //end the type[] with null
    return fCount;
    
