pkda5203/TM4C123GXL_DMX512_controller/khadka.c
}
//
bool isCommand(char str[], uint8_t pos[], char *cmd)
{
    return ((strcmp(&str[pos[0]],cmd))==0);
}

uint16_t getValue (char str[], uint8_t pos[], uint8_t argNum)
{
    uint16_t value = atoi(&str[*(pos+1+argNum)]);
    //putsUart0(&str[*(pos+1+argNum)]);
    // putsUart0("\n");
    return value;
}

char getString (char str[], uint8_t pos[], uint8_t argNum)
{
    //  putsUart0(&str[*(pos+1+argNum)]);
    // putsUart0("\n");
    return (&str[*(pos+1+argNum)]);
}

void toString(char str[], uint16_t num)
{
    uint16_t i, rem, len = 0, n;
    
    n = num;
    if (num==0)
    {
        str[len]=0+'0';
        len++;
        
    }
    while (n != 0)
    {
        len++;
        n /= 10;
    }
    for (i = 0; i < len; i++)
    {
        rem = num % 10;
        num = num / 10;
        str[len - (i + 1)] = rem + '0';
    }
    str[len] = 0;
}

void clearDmxData()
{
    ZERO_ANY_A(uint8_t, dmxData);
}

void timer1Isr()
{
    if (phase==0)               //when 176us has elapsed
    {
        //send MAB
        GPIO_PORTC_DATA_R |=0x20;                        //drive 1 on the Tx pin
        TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer before reconfiguring
        TIMER1_TAILR_R = 0x01E0;                         // set load value to 1EO for interrupt every 12 us
        TIMER1_CTL_R |= TIMER_CTL_TAEN;
        TIMER1_ICR_R = TIMER_ICR_TATOCINT;              //clear interrupt
        phase = 1;
    }
    else if (phase==1)
    {
        phase=2;
        GPIO_PORTC_AFSEL_R |= 0x30;                       //turn on UART on the pin
        // Configure UART1 to 250000 baud, 8N2 format (must be 3 clocks from clock enable and config writes)
        UART1_CTL_R = 0;                                  // turn-off UART0 to allow safe programming
        // delay4Cycles();
        UART1_CC_R = UART_CC_CS_SYSCLK;                  // use system clock (40 MHz)
        UART1_IBRD_R = 10;                               // r = 40 MHz / (Nx250kHz), set floor(r)=21, where N=16
        UART1_FBRD_R = 0;                               // round(fract(r)*64)=45
        UART1_LCRH_R = UART_LCRH_WLEN_8 | UART_LCRH_FEN |UART_LCRH_STP2 ; // configure for 8N1 w/o FIFO
        UART1_CTL_R = UART_CTL_TXE | UART_CTL_UARTEN| UART_CTL_EOT; // enable TX, RX, and module and end of transmission
        NVIC_EN0_R |= 1 << (INT_UART1-16);               // turn-on interrupt 22 (UART1)
        
        TIMER1_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer
        //    UART1_IM_R = UART_RIS_TXRIS;                     //enable the UART1 interrupt
        UART1_IM_R = UART_IM_TXIM;
        while (UART1_FR_R & UART_FR_TXFF);
        UART1_DR_R = 0;
        
    }
    TIMER1_ICR_R = TIMER_ICR_TATOCINT;                  //clear timer interrupt
}

//UART interrupt handler
void uart1Isr()
{
    if (UART1_MIS_R==UART_MIS_TXMIS)  //if the interrupt was triggered by UART TX
    {
        if ((phase-2)<maxM)                                 //transmit all 512 data
        {
            UART1_DR_R = dmxData[phase-2];
            phase++;
            UART1_ICR_R = UART_ICR_TXIC;                    //clear the uart interrupt
        }
        else
        {
            UART1_CTL_R =0;
            //putsUart0("ISR 2 FIRED");
            
            while (UART1_FR_R & UART_FR_BUSY);
            if (ON==1)
            {
                initTimer1();
            }
            UART1_ICR_R = UART_ICR_TXIC;
        }
    }
    else    //if the interrupt was triggered by UART RX
    {
        //  BLUE_LED=1;
        
        tempData=UART1_DR_R;
        if((tempData & UART_DR_BE)==UART_DR_BE)
        {
            rxPhase=1;
        }
        switch(rxPhase)
        {
            case 0: break;
            
            case 1:
            if((tempData & 0xFF)==0)
            {
                rxPhase=2;
                break;
            }
            
            case 2:
            rxData[rxPhase-2]=(tempData & 0xFF);
            rxPhase++;
            break;
            default:
            rxData[rxPhase-3]=(tempData & 0xFF);
            rxPhase++;
            break;
            //rxPhase++;
            
        }
        
    }
    UART1_ICR_R = UART_ICR_RXIC;
    //GREEN_LED=1;
}
//-----------------------------------------------------------------------------
// Main
//-----------------------------------------------------------------------------

int main(void)
{
    // Initialize hardware
    initHw();
    initEEPROM();
    // EEPROMinit();
    clearDmxData();     //intialize the dmx data table to zero
    // initTimer1();       //intialize the timer settings
    // Display greeting
    char uartString[MAX_CHAR+1];
    putsUart0("\n-----------------------------------------------------------\n");
    putsUart0("             CSE4342 Embedded Systems II\n                 Spring 2019 Project\n");
    putsUart0("------------------------------------------------------------\n");
    putsUart0("Name  : Prabesh Khadka\nUTA ID: 1001201007\n");
    putsUart0("------------------------------------------------------------\n");
    putsUart0("Welcome to my project!!!\n\n");
    if (MODE==1)
    {
        putsUart0("The MC is currently in DEVICE MODE!\n");
    }
    else if (MODE==0)
    {
        putsUart0("The MC is currently in CONTROLLER MODE\n");
    }
    
    if (glob==0)
    {
        putsUart0("The MC\n");
        glob++;
    }
    
    //step1
    //quickly flash the red and Green LED for 500ms  to check the LED are working
    flashRedLed(500000);
    waitMicrosecond(500000);
    flashGreenLed(500000);
    waitMicrosecond(500000);
    //end of step1
    
    
    
    
    if ((SYSCTL_PREEPROM_R & SYSCTL_PREEPROM_R0))
    {
        putsUart0("Succes DAJU");
    }
    EEPROM_EEBLOCK_R|=0x0;
    EEPROM_EEOFFSET_R|=0x1;
    
    if (EEPROM_EERDWR_R==0)
    {
        putsUart0("Device");
    }
    
    if (EEPROM_EERDWR_R==2)
    {
        putsUart0("controller");
    }
    if (MODE==1)
    {
        initUart1RX();
    }
    
    while(1)
    {
        uint8_t i;
        uint16_t address;
        uint16_t data;
        char type[MAX_CHAR+1];
        char uartString[MAX_CHAR+1];
        char buffer[20];
        bool OK;
        
        //step2
        putsUart0("$ ");
        getsUart0(uartString);
        flashGreenLed(50000);       //blink green LED Request
        putsUart0(uartString);      //display to the screen for debug
        putsUart0("\n");
        //end of step 2
        
        //step 3
        fieldCount=parseCommand(uartString,pos,type);
        
        //        //testing
        //        for(i=0; i<fieldCount; i++)
        //        {
        //            putsUart0(&uartString[*(pos+i)]);
        //            putsUart0("\n");
        //        }
        //        putsUart0("\n");
        //testing end
        //uint8_t hi = atoi(&uartString[*(pos+1)]);
        //end of step 3
        OK = false;
        
        
        
        if (MODE==0)
        {
            
