pkda5203/TM4C123GXL_DMX512_controller/khadka.c
            //step 4
            if(isCommand(uartString, pos, "clear") && (fieldCount>0))        //clear command
            {
                putsUart0("The command that you entered was CLEAR");
                putsUart0("\n");
                clearDmxData();
                OK=true;
            }
            
            
            if(isCommand(uartString, pos, "set") && (fieldCount>2))          //set command
            {
                putsUart0("The command that you entered was SET");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                data= getValue(uartString, pos, 1);
                if (!(address>=1 && address<=512))
                {
                    putsUart0("Invalid Address; 1-512 required!");
                    putsUart0("\n");
                }
                else if (!(data>=0 && data<=255))
                {
                    putsUart0("Invalid data; 0-255 required!");
                    putsUart0("\n");
                }
                else
                {
                    dmxData[address-1]=data;
                    OK=true;
                }
                
            }
            
            if(isCommand(uartString, pos, "get") && (fieldCount>1))      //get
            {
                putsUart0("The command that you entered was GET");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=1 && address<=512))
                {
                    putsUart0("Invalid 1-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    toString(buffer,dmxData[address-1]);
                    putsUart0(buffer);
                    putsUart0("\n");
                    OK=true;
                }
            }
            
            if(isCommand(uartString, pos, "on") && (fieldCount==1))       //on cammand
            {
                putsUart0("The command that you entered was ON");
                putsUart0("\n");
                ON =1;
                OK=true;
                RED_LED=1;
                initTimer1();
            }
            
            if(isCommand(uartString, pos, "off") && (fieldCount==1))      //off command
            {
                putsUart0("The command that you entered was OFF");
                putsUart0("\n");
                ON =0;
                RED_LED=0;
                OK=true;
            }
            
            if(isCommand(uartString, pos, "max") && (fieldCount>0))      //max command
            {
                putsUart0("The command that you entered was MAX");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=0 && address<=512))
                {
                    putsUart0("Invalid 0-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    OK=true;
                    maxM=address;
                }
                
            }
            if(isCommand(uartString, pos, "device") && (fieldCount==1))      //controller command
            {
                putsUart0("The command that you entered was DEVICE");
                putsUart0("\n");
                ON =0;
                RED_LED=0;
                MODE=1;
                EEPROM_EEBLOCK_R|=0x0;
                EEPROM_EEOFFSET_R|=0x0;
                EEPROM_EERDWR_R=0;
                initUart1RX();
                OK=true;
                
            }
        }
        else if(MODE==1)
        {
            if(isCommand(uartString, pos, "controller") && (fieldCount==1))      //controller command
            {
                putsUart0("The command that you entered was CONTROLLER");
                putsUart0("\n");
                MODE=0;
                EEPROM_EEBLOCK_R|=0x0;
                EEPROM_EEOFFSET_R|=0x1;
                EEPROM_EERDWR_R=2;
                OK=true;
            }
            if(isCommand(uartString, pos, "address") && (fieldCount>0))      //max command
            {
                putsUart0("The command that you entered was ADDRESS");
                putsUart0("\n");
                address= getValue(uartString, pos, 0);
                if (!(address>=0 && address<=512))
                {
                    putsUart0("Invalid 0-512 required!");
                    putsUart0("\n");
                }
                else
                {
                    deviceAddress=address;
                    OK=true;
                }
                
            }
        }
        if(!OK)      //if the command wasn't processed or was unidentified
        {
            putsUart0("Error");
            putsUart0("\n");
            
        }
        else      //if the command was processed
        {
            putsUart0("Ready");
            putsUart0("\n");
        }
        
        
        //end of step 4 and 5
        
        
    }
    
}

